fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботыРег/ВКМ_ВыполненныеКлиентуРаботыРег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботыРег</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботыРег</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CommonModules/ВКМ_ГрупповоеСозданиеРНСервер/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция СоздатьДокументы(Период) Экспорт


Запрос = Новый Запрос;
Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ВыполненныеКлиентуРаботыРег.Договор КАК Договор,
		|	ВКМ_ВыполненныеКлиентуРаботыРег.Договор.Владелец КАК Контрагент,
		|	ВКМ_ВыполненныеКлиентуРаботыРег.Договор.Организация КАК Организация
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботыРег КАК ВКМ_ВыполненныеКлиентуРаботыРег
		|ГДЕ
		|	НЕ ВКМ_ВыполненныеКлиентуРаботыРег.Договор В
		|		(ВЫБРАТЬ
		|			РеализацияТоваровУслуг.Договор КАК Договор
		|		ИЗ
		|			Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ГДЕ
		|			РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КОнецПериода
		|			И РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора)
		|	И ВКМ_ВыполненныеКлиентуРаботыРег.Период МЕЖДУ &НачалоПериода И &КОнецПериода
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ВыполненныеКлиентуРаботыРег.Договор,
		|	ВКМ_ВыполненныеКлиентуРаботыРег.Договор.Владелец,
		|	ВКМ_ВыполненныеКлиентуРаботыРег.Договор.Организация";

Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
Запрос.УстановитьПараметр("ВидДоговора", ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание"));


РезультатЗапроса = Запрос.Выполнить();

ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

Результат = Новый Массив;

Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
		
	НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	НовыйДокумент.Дата = Период.ДатаОкончания;
	ЗаполнитьЗначенияСвойств(НовыйДокумент, ВыборкаДетальныеЗаписи);
	НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
	НовыйДокумент.ВыполнитьАвтозаполнение();
	
	ДанныеЗаполненияТЧ = Новый Структура();
	ДанныеЗаполненияТЧ.Вставить("Договор",ВыборкаДетальныеЗаписи.Договор);
	ДанныеЗаполненияТЧ.Вставить("Контрагент", ВыборкаДетальныеЗаписи.Контрагент);
	ДанныеЗаполненияТЧ.Вставить("Ссылка",НовыйДокумент.Ссылка);
	
	Результат.Добавить(ДанныеЗаполненияТЧ);
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);

КонецЦикла;

Возврат Результат;

КонецФункции


#КонецОбласти
